# coding:utf8
"""
--------------------------------------------------------------------------
    File:   7-3.py
    Auth:   zsdostar
    Date:   2018/1/5 16:59
    Sys:    Windows 10
--------------------------------------------------------------------------
    Desc:   如何让对象支持上下文管理
            __enter__, __exit__
--------------------------------------------------------------------------
"""


"""
__enter__: 通常enter用于初始化 该方法的返回值是with xxx as f:的f，可以为self
__exit__: 退出时调用清理的相关方法，同时一般把异常在这里声明出来，因为遇到异常立刻跳到exit里
            如果把该方法的返回值设为True就不报错了
"""

